zup/ЗУП_бюджет/src/InformationRegisters/СертификатыПоСпециальностиФизическихЛиц/СертификатыПоСпециальностиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СертификатыПоСпециальностиФизическихЛиц</name>
  <resources>
    <name>ДействуетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/ХарактеристикиОбъектовПоМедРегистру/ХарактеристикиОбъектовПоМедРегистру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХарактеристикиОбъектовПоМедРегистру</name>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ЭлементыКлассификаторовМедРегистра</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.УченыеСтепени</types>
      <types>CatalogRef.Должности</types>
      <types>EnumRef.СостоянияСотрудника</types>
      <types>EnumRef.ОтношениеКВоинскойОбязанности</types>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.ШтатноеРасписание</types>
      <types>CatalogRef.Награды</types>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      <types>CatalogRef.ОснованияУвольнения</types>
      <types>CatalogRef.УдалитьОснованияУвольнения</types>
      <types>CatalogRef.СтраныМира</types>
      <types>EnumRef.КатегорииДолжностейДляСтатистическогоУчета</types>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ОбразованиеФизическихЛиц</types>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
      <types>EnumRef.ВидыКадровыхСобытий</types>
      <types>EnumRef.ВидыЗанятости</types>
      <types>CatalogRef.УчебныеЗаведения</types>
      <types>CatalogRef.СостояниеВБраке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Классификатор</name>
    <type>
      <types>CatalogRef.КлассификаторыМедРегистра</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/СвойстваДолжностейМедицинскихРаботников/СвойстваДолжностейМедицинскихРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваДолжностейМедицинскихРаботников</name>
  <resources>
    <name>ЯвляетсяМедицинскойДолжностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/СпособыПримененияЗначенийПоказателейРасчетаЗарплаты/СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПримененияЗначенийПоказателейРасчетаЗарплаты</name>
  <enumValues>
    <name>Постоянное</name>
  </enumValues>
  <enumValues>
    <name>Разовое</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/КатегорииНачисленийИНеоплаченногоВремени/КатегорииНачисленийИНеоплаченногоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииНачисленийИНеоплаченногоВремени</name>
  <enumValues>
    <name>ПовременнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>СдельнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТрудаВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>ДоходВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>КомпенсационныеВыплаты</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>КвартальнаяПремия</name>
  </enumValues>
  <enumValues>
    <name>РайонныйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>СевернаяНадбавка</name>
  </enumValues>
  <enumValues>
    <name>УправленческийУчет</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеКомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтпуска</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпускуГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпуску</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпускеГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпуске</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоБолезни</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоНезависящимОтРаботодателяПричинам</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодКомандировки</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКомандировки</name>
  </enumValues>
  <enumValues>
    <name>СохраняемоеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
  </enumValues>
  <enumValues>
    <name>ОплатаСверхурочныхВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамВоеннослужащего</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛиста</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛистаЗаСчетРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоПрофзаболевание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработкаЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛетВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛет</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоТрехЛет</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособиеМесячноеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособие</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаСовмещение</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаработокНаВремяТрудоустройства</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>Льгота</name>
  </enumValues>
  <enumValues>
    <name>ВыбираемаяСотрудникомЛьгота</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаВредность</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПредыдущимиДокументами</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоДенежногоСодержанияЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниЧасыПриУвольнении</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниПриУвольненииГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ДоначислениеДоУправленческогоУчета</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияМоральногоВреда</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ВидыРабочегоВремениСотрудников/ВидыРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРабочегоВремениСотрудников</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ВидыНачисленийОплатыТрудаДляНУ/ВидыНачисленийОплатыТрудаДляНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНачисленийОплатыТрудаДляНУ</name>
  <enumValues>
    <name>пп1ст255</name>
  </enumValues>
  <enumValues>
    <name>пп2ст255</name>
  </enumValues>
  <enumValues>
    <name>пп3ст255</name>
  </enumValues>
  <enumValues>
    <name>пп4ст255</name>
  </enumValues>
  <enumValues>
    <name>пп5ст255</name>
  </enumValues>
  <enumValues>
    <name>пп6ст255</name>
  </enumValues>
  <enumValues>
    <name>пп7ст255</name>
  </enumValues>
  <enumValues>
    <name>пп8ст255</name>
  </enumValues>
  <enumValues>
    <name>пп9ст255</name>
  </enumValues>
  <enumValues>
    <name>пп10ст255</name>
  </enumValues>
  <enumValues>
    <name>пп11ст255</name>
  </enumValues>
  <enumValues>
    <name>пп12ст255</name>
  </enumValues>
  <enumValues>
    <name>пп12_1ст255</name>
  </enumValues>
  <enumValues>
    <name>пп13ст255</name>
  </enumValues>
  <enumValues>
    <name>пп14ст255</name>
  </enumValues>
  <enumValues>
    <name>пп15ст255</name>
  </enumValues>
  <enumValues>
    <name>пп16ст255</name>
  </enumValues>
  <enumValues>
    <name>пп17ст255</name>
  </enumValues>
  <enumValues>
    <name>пп18ст255</name>
  </enumValues>
  <enumValues>
    <name>пп19ст255</name>
  </enumValues>
  <enumValues>
    <name>пп20ст255</name>
  </enumValues>
  <enumValues>
    <name>пп21ст255</name>
  </enumValues>
  <enumValues>
    <name>пп22ст255</name>
  </enumValues>
  <enumValues>
    <name>пп23ст255</name>
  </enumValues>
  <enumValues>
    <name>пп24ст255</name>
  </enumValues>
  <enumValues>
    <name>пп24_1ст255</name>
  </enumValues>
  <enumValues>
    <name>пп25ст255</name>
  </enumValues>
  <enumValues>
    <name>пп48ст266</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ТипыАттестацииСотрудников/ТипыАттестацииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАттестацииСотрудников</name>
  <enumValues>
    <name>ПодтверждениеСоответствияДолжности</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеКвалификацииПоСпециальности</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/КатегорииСтажа/КатегорииСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСтажа</name>
  <enumValues>
    <name>ВыслугаЛет</name>
  </enumValues>
  <enumValues>
    <name>Медицинский</name>
  </enumValues>
  <enumValues>
    <name>Непрерывный</name>
  </enumValues>
  <enumValues>
    <name>Общий</name>
  </enumValues>
  <enumValues>
    <name>ОбщийНаучноПедагогический</name>
  </enumValues>
  <enumValues>
    <name>Педагогический</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РасширенныйСтраховой</name>
  </enumValues>
  <enumValues>
    <name>Северный</name>
  </enumValues>
  <enumValues>
    <name>Страховой</name>
  </enumValues>
  <enumValues>
    <name>ВыслугаЛетНаГосударственнойСлужбе</name>
  </enumValues>
  <enumValues>
    <name>ВыслугаЛетНаВоеннойСлужбе</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/CommonModules/Медицина/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицина".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗащитаПерсональныхДанных

// Процедура обеспечивает сбор сведений о хранении данных,
// относящихся к персональным.
//
// Параметры:
//		ТаблицаСведений - таблица значений с полями:
//			Объект 			- строка, содержащая полное имя объекта метаданных,
//			ПоляРегистрации - строка, в которой перечислены имена полей регистрации,
//								отдельные поля регистрации отделяются запятой,
//								альтернативные - символом "|",
//			ПоляДоступа		- строка, в которой перечислены через запятую имена полей доступа.
//			ОбластьДанных	- строка с идентификатором области данных, необязательно для заполнения.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	 ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияОРаботникахДляМедРегистра(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийСертификатыПоСпециальностиФизическихЛиц(ТаблицаСведений);
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияОРаботникахДляМедРегистра(ТаблицаСведений)
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.СведенияОРаботникахДляМедРегистра";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.ФизическоеЛицо,Образование.ФизическоеЛицо,Сертификаты.ФизическоеЛицо,Переподготовка.ФизическоеЛицо,ПовышениеКвалификации.ФизическоеЛицо,"
		+ "ПослевузовскоеОбразование.ФизическоеЛицо,КвалификационныеКатегории.ФизическоеЛицо,Награды.ФизическоеЛицо,ЛичноеДело.Сотрудник,Неявки.Сотрудник,Невыходы.Сотрудник,ФактическиОтработанноеВремя.Сотрудник";
	НовыеСведения.ПоляДоступа		= "";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	ПоляДоступа = "";
	ПоляИсключаемыеИзПерсональныхДанных = "Сотрудник,ФизическоеЛицо,";
	ТабличныеЧасти = Метаданные.Документы.СведенияОРаботникахДляМедРегистра.ТабличныеЧасти;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя+".";
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			
			ИмяРеквизита = Реквизит.Имя;
			Если СтрНайти(ПоляИсключаемыеИзПерсональныхДанных,ИмяРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			ПоляДоступа = ПоляДоступа + "," + ИмяТабличнойЧасти+ИмяРеквизита;
			
		КонецЦикла;
	КонецЦикла;
	
	ПоляДоступа = Сред(ПоляДоступа,2);
	НовыеСведения.ПоляДоступа = ПоляДоступа;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийСертификатыПоСпециальностиФизическихЛиц(ТаблицаСведений)
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.СертификатыПоСпециальностиФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Специальность,ДатаПолучения,ДействуетПо,Серия,Номер,КемВыдан";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИБ

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.30";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("117d3329-ab49-4626-8812-e85c44a5f0f2");
	Обработчик.Процедура = "Документы.СведенияОРаботникахДляМедРегистра.ЗаполнитьТабличныеЧастиДокументов";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение новых табличных частей документа ""Сведения о медицинских работниках"".'");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ФедеральныйРегистрМедицинскихРаботников") Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.106";
		Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("117d3329-ab49-4626-8812-e85c44a5f0f3");
		Обработчик.Процедура = "Медицина.ЗаполнитьПодключаемыеХарактеристики";
		Обработчик.Комментарий = НСтр("ru = 'Обновление подключаемых характеристик'");
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.20";
	Обработчик.Процедура = "Медицина.УстановитьПараметрыНабораСвойствСправочниковДоступКНаркотическимСредствам";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("caf482e6-c48c-4f7c-9fb9-dc434f85b74f");
	Обработчик.Комментарий = НСтр("ru = 'Установка параметров для набора свойств справочников медицины. Дополнительные реквизиты временно недоступны..'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.20";
	Обработчик.Процедура = "Медицина.УстановитьПараметрыНабораСвойствКлассификаторыМедРегистра";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ae16e4d0-9eed-4f9b-aa3c-d59b6b4b7a49");
	Обработчик.Комментарий = НСтр("ru = 'Установка параметров для набора свойств справочников.'");
	
КонецПроцедуры

Процедура УстановитьПараметрыНабораСвойствСправочниковДоступКНаркотическимСредствам(ПараметрыОбновления = НеОпределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ДоступКНаркотическимСредствам");
		Модуль.УстановитьПараметрыНабораСвойствСправочников();
	КонецЕсли;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрыНабораСвойствКлассификаторыМедРегистра(ПараметрыОбновления = НеОпределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ФедеральныйРегистрМедицинскихРаботников") Тогда
		ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
		ПараметрыНабора.Используется = Константы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников.Получить();
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_КлассификаторыМедРегистра", ПараметрыНабора);
	КонецЕсли;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПодключаемыеХарактеристики(ПараметрыОбновления = Неопределено) Экспорт
	
	ИспользуетсяФРМР = Константы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников.Получить();
	РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.ОбновитьПодключаемыеХарактеристики(ИспользуетсяФРМР, , , ПараметрыОбновления);
	
КонецПроцедуры

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	// Здесь перечисляются неразделенные объекты метаданных ссылочного типа, имеющие непредопределенные элементы.
	// В модуле менеджера таких объектов должна быть определена функция ПоляЕстественногоКлюча, 
	// составляющая массив полей для однозначной идентификации элемента.
	Типы.Добавить(Метаданные.Справочники.КлассификаторыМедРегистра);
	Типы.Добавить(Метаданные.Справочники.ЭлементыКлассификаторовМедРегистра);
	
КонецПроцедуры

Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	
	НазначениеРолей.ТолькоДляПользователейСистемы.Добавить(Метаданные.Роли.НастройкаМедрегистраОбщиеДанные.Имя);

КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ФедеральныйРегистрМедицинскихРаботников") Тогда
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияОРаботникахДляМедРегистра",			"Дата", "КадровыйУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияОШтатномРасписанииДляМедРегистра",	"Дата", "КадровыйУчет", "Организация");
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкиПрограммыБюджетногоУчреждения(НастройкиПрограммы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаКонстант = "ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников,ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА,ИспользоватьДоступКНаркотическимСредствам";
	Настройка = Константы.СоздатьНабор(СтрокаКонстант);
	Настройка.Прочитать();
	ЗаполнитьЗначенияСвойств(НастройкиПрограммы, Настройка, СтрокаКонстант);
	
КонецФункции

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников.Установить(Параметры.ПараметрыПрограммы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников);
	Константы.ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА.Установить(Параметры.ПараметрыПрограммы.ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА);
	Константы.ИспользоватьДоступКНаркотическимСредствам.Установить(Параметры.ПараметрыПрограммы.ИспользоватьДоступКНаркотическимСредствам);
	
КонецПроцедуры

Функция ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапросаКомпоновки) Экспорт
	
	Запрос = Неопределено;
	
	Если ВРег(ИмяПредставления) = ВРег("СертификатыПоСпециальностиФизическихЛиц") Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыПоСпециальностиФизическихЛиц.ФизическоеЛицо,
		|	СертификатыПоСпециальностиФизическихЛиц.Специальность,
		|	СертификатыПоСпециальностиФизическихЛиц.ДатаПолучения,
		|	СертификатыПоСпециальностиФизическихЛиц.ДействуетПо,
		|	СертификатыПоСпециальностиФизическихЛиц.Серия,
		|	СертификатыПоСпециальностиФизическихЛиц.Номер,
		|	СертификатыПоСпециальностиФизическихЛиц.КемВыдан,
		|	ВТСотрудники.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ Представления_СертификатыПоСпециальностиФизическихЛиц
		|ИЗ
		|	ВТОсновныеСотрудники КАК ВТСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификатыПоСпециальностиФизическихЛиц КАК СертификатыПоСпециальностиФизическихЛиц
		|		ПО ВТСотрудники.ФизическоеЛицо = СертификатыПоСпециальностиФизическихЛиц.ФизическоеЛицо";
	КонецЕсли;
	
	Возврат Запрос;	
	
КонецФункции

Процедура ЗаписатьНастройкиМедицинскогоУчреждения(НастройкиПрограммы) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		Возврат;
	КонецЕсли;
	
	Константы.РаботаВМедицинскомУчреждении.Установить(НастройкиПрограммы.РаботаВМедицинскомУчреждении);
	Константы.ИспользоватьПодработки.Установить(НастройкиПрограммы.ИспользоватьПодработки);
	Константы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников.Установить(НастройкиПрограммы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников);
	Константы.ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА.Установить(НастройкиПрограммы.ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА);
	Константы.ИспользоватьДоступКНаркотическимСредствам.Установить(НастройкиПрограммы.ИспользоватьДоступКНаркотическимСредствам);
	
КонецПроцедуры

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.СведенияОРаботникахДляМедРегистра);
	СписокОбъектов.Добавить(Документы.СведенияОШтатномРасписанииДляМедРегистра);
	СписокОбъектов.Добавить(Документы.ДопускКНаркотическимВеществам);
	СписокОбъектов.Добавить(Документы.ЗапросВФСКН); 
	СписокОбъектов.Добавить(Документы.ОтветФСКН); 
	
КонецПроцедуры

Функция РаботаВМедицинскомУчреждении() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении");
	
КонецФункции

Функция НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета) 
	
	ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = '% надб.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.Предопределенный = Ложь;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ОписаниеПоказателя.Точность = 2;
	ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;

	Возврат ОписаниеПоказателя;

КонецФункции

Процедура СоздатьПоказателиМедицинскихУчреждений(НастройкиРасчетаЗарплаты, ПараметрыПланаВидовРасчета) Экспорт 
	
	СоздаватьПоказатели = РаботаВМедицинскомУчреждении();
	
	ПоказателиРасчетаЗарплатыМенеджер = Справочники.ПоказателиРасчетаЗарплаты;

	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;
	СозданныеЭлементы    = ПараметрыПланаВидовРасчета.СсылкиПоказателиРасчетаЗарплаты;
	
	Если СоздаватьПоказатели И НастройкиРасчетаЗарплаты.ИспользоватьКвалификационнуюНадбавку Тогда 
		
		// Процент надбавки за квалификационную категорию
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаКатегорию";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за квалификационную категорию'");
		ОписаниеПоказателя.Предопределенный = Истина;
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
	Иначе 
		ПоказателиРасчетаЗарплатыМенеджер.ОтключитьИспользованиеПредопределенногоЭлемента("ПроцентНадбавкиЗаКатегорию");
	КонецЕсли;
	
	Если СоздаватьПоказатели Тогда 
		
		// Процент надбавки за ученую степень
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаУченуюСтепень";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за ученую степень'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		// Процент надбавки за почетное звание
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаПочетноеЗвание";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за почетное звание'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
				
		// Процент надбавки за классность и езду водителей
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаЕзду";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за классность и езду'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		// Понижающий процент к окладу
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентСниженияОклада";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент снижения оклада'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = '% сниж.'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		РегистрыСведений.НастройкаПоказателейТарификацииМедРаботников.ОбновитьДанныеРегистра();
		
	Иначе 
		
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентНадбавкиЗаУченуюСтепень");
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентНадбавкиЗаПочетноеЗвание");
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентНадбавкиЗаЕзду");
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентСниженияОклада");
		
	КонецЕсли;

КонецПроцедуры

Функция НовоеОписаниеНачисления(СвойстваНачислений, ЗависимоеВторогоУровня = Ложь) 
	
	Категории = Новый Массив;
	Категории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда);

	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);

	ОтборБазовых = Новый Структура;
	ОтборБазовых.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", Категории);
	ОтборБазовых.Вставить("ВидВремени", ВидыВремени);
	ОтборБазовых.Вставить("ТребуетсяРасчетБазы", ЗависимоеВторогоУровня);	

	Описание = ПланыВидовРасчета.Начисления.ОписаниеНачисления();
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда;
	Описание.СвойстваПоКатегории	= СвойстваНачислений[Описание.КатегорияНачисленияИлиНеоплаченногоВремени];
	Описание.ВидВремени 			= Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы;
	Описание.ВидНачисленияДляНУ		= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.ОтборБазовых 			= ОтборБазовых;
	Описание.КлючевыеСвойства 		= "Ссылка";

	Возврат Описание;

КонецФункции

Процедура СоздатьНачисленияМедицинскихУчреждений(НастройкиРасчетаЗарплаты, КоллекторНачислений, СвойстваНачислений, ПараметрыПланаВидовРасчета) Экспорт 
	
	СоздаватьНачисления = РаботаВМедицинскомУчреждении();
	
	НачисленияМенеджер = ПланыВидовРасчета.Начисления;
	
	// Надбавка за квалификационную категорию (процентом)
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаКвалификационнуюКатегориюПроцентом";
	
	Описание = НовоеОписаниеНачисления(СвойстваНачислений);
	Описание.Код					= НСтр("ru = 'НККП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за квалификационную категорию'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Квалиф. категория'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаКатегорию / 100";
	Описание.ЗапрашиваемыеПоказатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПроцентНадбавкиЗаКатегорию");
	Описание.СсылкаНаОбъект 		 = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления И НастройкиРасчетаЗарплаты.ИспользоватьКвалификационнуюНадбавку Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;

	// Надбавка за ученую степень (процентом)
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаУченуюСтепеньПроцентом";
	
	Описание = НовоеОписаниеНачисления(СвойстваНачислений);
	Описание.Код					= НСтр("ru = 'НУСП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за ученую степень'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Ученая степень'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаУченуюСтепень / 100";
	Описание.ЗапрашиваемыеПоказатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПроцентНадбавкиЗаУченуюСтепень");
	Описание.СсылкаНаОбъект 		 = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;

	// Надбавка за почетное звание (процентом)
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаПочетноеЗваниеПроцентом";

	Описание = НовоеОписаниеНачисления(СвойстваНачислений);
	Описание.Код					= НСтр("ru = 'НПЗП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за почетное звание'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Почетное звание'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаПочетноеЗвание / 100";
	Описание.ЗапрашиваемыеПоказатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПроцентНадбавкиЗаПочетноеЗвание");
	Описание.СсылкаНаОбъект 		 = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;
				
	// Надбавка за классность и езду
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаЕзду";

	Описание = НовоеОписаниеНачисления(СвойстваНачислений, Истина);
	Описание.Код					= НСтр("ru = 'НКЕП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за классность и езду'");
	Описание.КраткоеНаименование	= НСтр("ru = 'Езда'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаЕзду / 100";
	Описание.СсылкаНаОбъект 		= ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;

КонецПроцедуры

#Область События

Процедура ДокументыМедРегистраПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяДокумента = Источник.Метаданные().Имя;
	
	Если Не Источник.ПометкаУдаления Тогда
		
		Документы[ИмяДокумента].ОбработкаФормированияФайла(Источник);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодтверждениеКвалификацииМедицинскихРаботников

Функция ЭтоАттестацияМедицинскихРаботников(ВидАттестации) Экспорт
	Возврат ВидАттестации = ВидАттестацииМедицинскихРаботников();
КонецФункции 

Функция ВидАттестацииМедицинскихРаботников() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыАттестацийСотрудников.ПодтверждениеКвалификацииМедицинскихРаботников");
КонецФункции

Процедура СоздатьВидАттестацииМедицинскихРаботников() Экспорт
	
	Если РаботаВМедицинскомУчреждении() Тогда
		
		ВидАттестацииСсылка = ВидАттестацииМедицинскихРаботников();
		
		Если ЗначениеЗаполнено(ВидАттестацииСсылка) Тогда
			ВидАттестации =  ВидАттестацииСсылка.ПолучитьОбъект();
		Иначе
			ВидАттестации = Справочники.ВидыАттестацийСотрудников.СоздатьЭлемент();
			ВидАттестации.ИмяПредопределенныхДанных = "ПодтверждениеКвалификацииМедицинскихРаботников";
		КонецЕсли;
		
		ВидАттестации.Наименование = НСтр("ru = 'Подтверждение квалификации медицинских работников'");
		ВидАттестации.ЭтоВнешняяАттестация = Истина;
		ВидАттестации.ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеКвалификацииПоСпециальности;
		ВидАттестации.Периодичность = Перечисления.Периодичность.Год;
		ВидАттестации.КоличествоПериодов = 5;
		ВидАттестации.ИспользоватьОграничениеПоМаксимальномуВозрасту = Ложь;
		ВидАттестации.ИспользоватьОграничениеПоМинимальномуСрокуРаботы = Ложь;
		ВидАттестации.Записать();
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаОписанияАттестаций(ТекстЗапроса) Экспорт
	
	Если ВидАттестацииМедицинскихРаботников() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ " + ТекстЗапросаОписанияАттестаций();
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаДолжностиВидовАттестаций(ТекстЗапроса) Экспорт
	
	Если ВидАттестацииМедицинскихРаботников() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ " + ТекстЗапросаДолжностиВидовАттестаций();
	
КонецПроцедуры

Функция АттестационныеЛистыСотрудников(ПриказыОбАттестации, ОбъектыПечати) Экспорт
	
	Возврат Обработки.ПечатьКадровыхПриказовМедицинскихОрганизаций.АттестационныеЛистыМедицинскихРаботников(ПриказыОбАттестации, ОбъектыПечати);

КонецФункции

Процедура ДобавитьКомандыПечатиПриказаОбАттестации(КомандыПечати) Экспорт
	Если РаботаВМедицинскомУчреждении() Тогда 
		ДобавитьКомандуПечатиОтчетаОПрофессиональнойДеятельности(КомандыПечати);
		ДобавитьКомандуПечатиЗаявленияОПодтвержденииКвалификации(КомандыПечати);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьКомандуПечатиОтчетаОПрофессиональнойДеятельности(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "ЗарплатаКадрыКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовМедицинскихОрганизаций";
	КомандаПечати.Идентификатор = "ПФ_MXL_ОтчетОПрофессиональнойДеятельности";
	КомандаПечати.Представление = НСтр("ru = 'Отчет о профессиональной деятельности (титульный лист)'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
КонецПроцедуры

Процедура ДобавитьКомандуПечатиЗаявленияОПодтвержденииКвалификации(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "ЗарплатаКадрыКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовМедицинскихОрганизаций";
	КомандаПечати.Идентификатор = "ПФ_MXL_ЗаявлениеОПодтвержденииКвалификации";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на подтверждение квалификации по специальности'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
КонецПроцедуры

Функция ТекстОписанияВидаАттестацииМедицинскихРаботников() Экспорт
	Возврат Нстр("ru = 'Аттестации подлежат все сотрудники, работающие на должностях, являющихся должностями медицинских работников.'");
КонецФункции 

#КонецОбласти

#Область СправочникДолжности 

Процедура ДополнитьФормуЭлементаСправочникаДолжности(Форма, ИмяГруппыДляВставки = "ГруппаМедицинскаяДолжность") Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СвойстваДолжностейМедицинскихРаботников", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СвойстваДолжностейМедицинскихРаботников"),,,Истина));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппыДляВставки); 
	ОписанияРесурсов = Метаданные.РегистрыСведений.СвойстваДолжностейМедицинскихРаботников.Ресурсы;
	ПрефиксПутиКДанным = "СвойстваДолжностейМедицинскихРаботников";
	
	ДобавитьПолеВвода(Форма, ГруппаФормы, ОписанияРесурсов.Найти("ЯвляетсяМедицинскойДолжностью"), ПрефиксПутиКДанным);
	
КонецПроцедуры

Процедура ДобавитьПолеВвода(Форма, ГруппаФормы, ОписаниеСвойства, ПрефиксПутиКДанным = Неопределено, ВариантОтображениеПодсказки = Неопределено)
	
	Если НЕ Форма.Элементы.Найти(ОписаниеСвойства.Имя) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеВвода 				= Форма.Элементы.Вставить(ОписаниеСвойства.Имя, Тип("ПолеФормы"), ГруппаФормы);
	ПолеВвода.ПутьКДанным 	= ПрефиксПутиКДанным + ?(ПрефиксПутиКДанным = Неопределено, "", ".") + ОписаниеСвойства.Имя;
	
	Если ОписаниеСвойства.Тип = Новый ОписаниеТипов("Булево") Тогда
		ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	Иначе
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
	ПолеВвода.Заголовок = ОписаниеСвойства.Синоним;
	ПолеВвода.Подсказка = ОписаниеСвойства.Подсказка;
	
	Если НЕ ВариантОтображениеПодсказки = Неопределено Тогда
		ПолеВвода.ОтображениеПодсказки = ВариантОтображениеПодсказки;
	КонецЕсли;
	
	ПолеВвода.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеДолжности(Форма) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СвойстваДолжностейМедицинскихРаботников) Тогда
		Возврат;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.СвойстваДолжностейМедицинскихРаботников.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Должность = Форма.Объект.Ссылка;
	МенеджерЗаписи.Прочитать();
	
	ЗначениеВДанныеФормы(МенеджерЗаписи, Форма.СвойстваДолжностейМедицинскихРаботников);
КонецПроцедуры

Процедура ЗаписатьДополнительныеДанныеДолжности(Форма, Ссылка) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СвойстваДолжностейМедицинскихРаботников) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СвойстваДолжностейМедицинскихРаботников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Должность.Установить(Ссылка);
	
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, Форма.СвойстваДолжностейМедицинскихРаботников);
	Запись.Должность = Ссылка;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АвтоматическийРасчетСтажейФизическихЛиц") Тогда
		
		МодульАвтоматическийРасчетСтажейФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АвтоматическийРасчетСтажейФизическихЛиц");
		МодульАвтоматическийРасчетСтажейФизическихЛиц.УстановитьДополнительноеСвойствоПропуститьОбновлениеЗависимыхСтажей(НаборЗаписей.ДополнительныеСвойства);
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

Функция ТекстЗапросаОписанияАттестаций()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыАттестацийСотрудников.Ссылка КАК ВидАттестации,
	|	ВидыАттестацийСотрудников.ТипАттестации,
	|	ВидыАттестацийСотрудников.ЭтоВнешняяАттестация,
	|	ВидыАттестацийСотрудников.Периодичность,
	|	ВидыАттестацийСотрудников.КоличествоПериодов,
	|	ВидыАттестацийСотрудников.ИспользоватьОграничениеПоМинимальномуВозрасту,
	|	ВидыАттестацийСотрудников.ВозрастДоКоторогоСотрудникНеПодлежитАттестации,
	|	ВидыАттестацийСотрудников.ИспользоватьОграничениеПоМаксимальномуВозрасту,
	|	ВидыАттестацийСотрудников.ВозрастПослеКоторогоСотрудникНеПодлежитАттестации,
	|	ВидыАттестацийСотрудников.ИспользоватьОграничениеПоМинимальномуСрокуРаботы,
	|	ВидыАттестацийСотрудников.ПериодичностьМинимальногоСрокаРаботы,
	|	ВидыАттестацийСотрудников.КоличествоПериодовМинимальногоСрокаРаботы,
	|	ВидыАттестацийСотрудников.АттестовыватьВсеДолжностиСпециальности,
	|	ИСТИНА КАК ОтборПоДолжности
	|ИЗ
	|	Справочник.ВидыАттестацийСотрудников КАК ВидыАттестацийСотрудников
	|ГДЕ
	|	ВидыАттестацийСотрудников.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыАттестацийСотрудников.ПодтверждениеКвалификацииМедицинскихРаботников)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДолжностиВидовАттестаций()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыАттестацийСотрудников.Ссылка КАК ВидАттестации,
	|	Должности.Ссылка КАК Должность
	|ИЗ
	|	Справочник.ВидыАттестацийСотрудников КАК ВидыАттестацийСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
	|			ПО Должности.Ссылка = СвойстваДолжностейМедицинскихРаботников.Должность
	|				И (СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью)
	|		ПО (ВидыАттестацийСотрудников.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыАттестацийСотрудников.ПодтверждениеКвалификацииМедицинскихРаботников))";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Сведения о стаже

Функция НеобходимыСведенияОМедицинскомСтаже(Знач ИмяПоля) Экспорт
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("МедицинскийСтажВид")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажПериодРегистрации")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажРазмерМесяцев")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажРазмерДней")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажДней")
		ИЛИ	ИмяПоля = ВРег("МедицинскийСтажМесяцев")
		ИЛИ	ИмяПоля = ВРег("МедицинскийСтажЛет");
		
КонецФункции

Функция ПутьКДаннымСведенийОСтаже(Знач ИмяПоля) Экспорт
	
	ИмяПоля = ВРег(ИмяПоля);
	
	ИмяТаблицы = КадровыйУчетРасширенный.ИмяТаблицыПоКатегорииСтажа(Перечисления.КатегорииСтажа.Медицинский);
	
	Если ИмяПоля = ВРег("МедицинскийСтажВид") Тогда
		Возврат ИмяТаблицы + ".ВидСтажа";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажПериодРегистрации") Тогда
		Возврат ИмяТаблицы + ".ПериодРегистрации";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажРазмерМесяцев") Тогда
		Возврат ИмяТаблицы + ".РазмерМесяцев";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажРазмерДней") Тогда
		Возврат ИмяТаблицы + ".РазмерДней";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажДней") Тогда
		Возврат ИмяТаблицы + ".Дней";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажМесяцев") Тогда
		Возврат ИмяТаблицы + ".Месяцев";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажЛет") Тогда
		Возврат ИмяТаблицы + ".Лет";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ОписаниеСтажаДляОпределенияКритериевПоискаСотрудников() Экспорт
	
	Возврат Новый Структура("КатегорияСтажа,Идентификатор", Перечисления.КатегорииСтажа.Медицинский, "МедицинскийСтаж");
	
КонецФункции

Процедура ДополнитьТаблицуДополнительныхПолейПредставленийОтчетовПоСотрудникам(ДополнительныеПоляПредставлений) Экспорт
	
	СтрокаДополнительногоПоля = ДополнительныеПоляПредставлений.Добавить();
	СтрокаДополнительногоПоля.ИмяПоля = "МедицинскийСтажДней";
	СтрокаДополнительногоПоля.ПустоеЗначениеНаЯзыкеЗапросов = "0";
	СтрокаДополнительногоПоля.ЗаголовокПоляСКД = НСтр("ru='Медицинский стаж (дней)'");
	СтрокаДополнительногоПоля.ПутьПоляСКД = "ЛичныеДанные.Стажи.МедицинскийСтажДней";
	
	СтрокаДополнительногоПоля = ДополнительныеПоляПредставлений.Добавить();
	СтрокаДополнительногоПоля.ИмяПоля = "МедицинскийСтажМесяцев";
	СтрокаДополнительногоПоля.ПустоеЗначениеНаЯзыкеЗапросов = "0";
	СтрокаДополнительногоПоля.ЗаголовокПоляСКД = НСтр("ru='Медицинский стаж (месяцев)'");
	СтрокаДополнительногоПоля.ПутьПоляСКД = "ЛичныеДанные.Стажи.МедицинскийСтажМесяцев";
	
	СтрокаДополнительногоПоля = ДополнительныеПоляПредставлений.Добавить();
	СтрокаДополнительногоПоля.ИмяПоля = "МедицинскийСтажЛет";
	СтрокаДополнительногоПоля.ПустоеЗначениеНаЯзыкеЗапросов = "0";
	СтрокаДополнительногоПоля.ЗаголовокПоляСКД = НСтр("ru='Медицинский стаж (лет)'");
	СтрокаДополнительногоПоля.ПутьПоляСКД = "ЛичныеДанные.Стажи.МедицинскийСтажЛет";
	
КонецПроцедуры

Функция СвойстваОбъектаМетаданных(Тип) Экспорт

	СвойстваОбъекта = Новый Структура("ТипОбъекта,ПолноеИмя,ПолныйСиноним,ПредставлениеОбъекта,ЭтоСправочник,Иерархический,ИерархияГрупп,ЕстьВладелец,ТипВладельца");
	СвойстваОбъекта.ЭтоСправочник = Истина;
	СвойстваОбъекта.ИерархияГрупп = Ложь;
	СвойстваОбъекта.Иерархический = Ложь;
	СвойстваОбъекта.ЕстьВладелец  = Ложь;
	
	СвойстваОбъекта.ПолныйСиноним = "";
	
	Если Не ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
	СвойстваОбъекта.ПолноеИмя = МетаданныеТипа.ПолноеИмя();
	
	ЧастиПолногоИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СвойстваОбъекта.ПолноеИмя, ".");

	Если ЧастиПолногоИмени[0] = "Справочник" Тогда
		
		СвойстваОбъекта.ТипОбъекта = "СправочникСсылка." + ЧастиПолногоИмени[1];
		СвойстваОбъекта.ПолныйСиноним = МетаданныеТипа.Представление();
		СвойстваОбъекта.ПредставлениеОбъекта = МетаданныеТипа.ПредставлениеОбъекта;
		
		Если МетаданныеТипа.Иерархический Тогда
			 СвойстваОбъекта.Иерархический = Истина;
			 СвойстваОбъекта.ИерархияГрупп = (МетаданныеТипа.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов);
		КонецЕсли;
		 
		Если МетаданныеТипа.Владельцы.Количество() Тогда
		    СвойстваОбъекта.ЕстьВладелец = Истина;
			Если ЧастиПолногоИмени[1] = "ОбразованиеФизическихЛиц" Тогда
				СвойстваОбъекта.ТипВладельца = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
			Иначе
				СвойстваОбъекта.ТипВладельца = Новый ОписаниеТипов("СправочникСсылка.Организации");
			КонецЕсли;
		КонецЕсли;
		 
	ИначеЕсли ЧастиПолногоИмени[0] = "Перечисление" Тогда
		
		СвойстваОбъекта.ТипОбъекта = "ПеречислениеСсылка." + ЧастиПолногоИмени[1];
		СвойстваОбъекта.ПолныйСиноним = МетаданныеТипа.Представление();
		СвойстваОбъекта.ПредставлениеОбъекта = МетаданныеТипа.Синоним;
		СвойстваОбъекта.ЭтоСправочник = Ложь;
		
	КонецЕсли;
	
	Если ПустаяСтрока(СвойстваОбъекта.ПредставлениеОбъекта) Тогда
		СвойстваОбъекта.ПредставлениеОбъекта = СвойстваОбъекта.ПолныйСиноним;
	КонецЕсли;
	
	Возврат СвойстваОбъекта;

КонецФункции 

Процедура ДополнитьВидамиСтажаДолжностей(Должность, ВидыСтажаДолжностей) Экспорт
	
	Если РаботаВМедицинскомУчреждении() Тогда
		
		Запрос = Новый Запрос;
		
		Если ТипЗнч(Должность) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
			Запрос.УстановитьПараметр("Должность", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Должность, "Должность"));
		Иначе
			Запрос.УстановитьПараметр("Должность", Должность);
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью КАК ЯвляетсяМедицинскойДолжностью
			|ИЗ
			|	РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
			|ГДЕ
			|	СвойстваДолжностейМедицинскихРаботников.Должность = &Должность
			|	И СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыСтажаДолжностей, ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста());
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДолжностиСАвтоматическимУчетомПрерыванияСтажей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвойстваДолжностейМедицинскихРаботников.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
		|ГДЕ
		|	СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Должность");
	
КонецФункции

Функция ВидыСтажейПоСвойствамДолжностиФормы(Форма) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат ВидыСтажейПоСвойствамДолжностей(Форма.СвойстваДолжностейМедицинскихРаботников);
	
КонецФункции

Функция ВидыСтажейПоСвойствамДолжностей(СвойствамДолжностей) Экспорт
	
	Если СвойствамДолжностей.ЯвляетсяМедицинскойДолжностью Тогда
		ВидыСтажаДолжностей = ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста();
	Иначе
		ВидыСтажаДолжностей = Новый Массив;
	КонецЕсли;
	
	Возврат ВидыСтажаДолжностей;
	
КонецФункции

Функция ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста() Экспорт
	
	Возврат Справочники.ВидыСтажа.ВидыСтажаПоКатегории(Перечисления.КатегорииСтажа.Медицинский);
	
КонецФункции

#КонецОбласти
